Revit 2024 API
Application.WriteJournalComment Method
 Writes a comment to the Revit journal file.
Namespace: Autodesk.Revit.ApplicationServices
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public void WriteJournalComment(
	string comment,
	bool timeStamp
)
Visual Basic
Public Sub WriteJournalComment ( _
	comment As String, _
	timeStamp As Boolean _
)
Visual C++
public:
void WriteJournalComment(
	String^ comment,
	bool timeStamp
)
Parameters
comment
Type: System.String
 Text for journal comment.
timeStamp
Type: System.Boolean
 If a time stamp should be included in the journal comment.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
Application Class
Autodesk.Revit.ApplicationServices Namespace